
"event read status update" = "tapahtuman luvun tilan päivitys";

"device event status updated. The save" = "laitteen tapahtuman tila päivitetty. Tallennus";

"Resolved" = "Ratkaistu";
"Unresolved" = "Ei ratkaistu";


"The message status could not be updated" = "Viestin tilaa ei voi päivittää";

// K9 : event status update error message
"Your HP device has sent a status update. This update could not be saved in HP Utility - Message Center" = "HP-laitteesi on lähettänyt tilapäivityksen. Päivitystä ei voitu tallentaa HP Utility - Viestikeskus";

"Messages could not be displayed in HP Utility - Message Center" = "Viestejä ei voitu näyttää HP Utility - Viestikeskus";